damon-yun/AliOS-Things/platform/mcu/mimxrt1052cvl5b/lwip-2.0.2/port/ethernetif.c
    return NULL;
}

static err_t ethernetif_init(struct netif *netif, struct ethernetif *ethernetif,
                             const uint8_t enetIdx,
                             const ethernetif_config_t *ethernetifConfig)
{
    LWIP_ASSERT("netif != NULL", (netif != NULL));
    LWIP_ASSERT("ethernetifConfig != NULL", (ethernetifConfig != NULL));

#if LWIP_NETIF_HOSTNAME
    /* Initialize interface hostname */
    netif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

    /*
     * Initialize the snmp variables and counters inside the struct netif.
     * The last argument should be replaced with your link speed, in units
     * of bits per second.
     */
    MIB2_INIT_NETIF(netif, snmp_ifType_ethernet_csmacd, LINK_SPEED_OF_YOUR_NETIF_IN_BPS);

    netif->state = ethernetif;
    netif->name[0] = IFNAME0;
    netif->name[1] = IFNAME1;
/* We directly use etharp_output() here to save a function call.
 * You can instead declare your own function an call etharp_output()
 * from it if you have to do some checks before sending (e.g. if link
 * is available...) */
#if LWIP_IPV4
    netif->output = etharp_output;
#endif
#if LWIP_IPV6
    netif->output_ip6 = ethip6_output;
#endif /* LWIP_IPV6 */
    netif->linkoutput = low_level_output;

#if LWIP_IPV4 && LWIP_IGMP
    netif_set_igmp_mac_filter(netif, ethernetif_igmp_mac_filter);
    netif->flags |= NETIF_FLAG_IGMP;
#endif
#if LWIP_IPV6 && LWIP_IPV6_MLD
    netif_set_mld_mac_filter(netif, ethernetif_mld_mac_filter);
    netif->flags |= NETIF_FLAG_MLD6;
#endif

    /* Init ethernetif parameters.*/
    ethernetif->base = get_enet_base(enetIdx);
    LWIP_ASSERT("ethernetif->base != NULL", (ethernetif->base != NULL));

    /* initialize the hardware */
    low_level_init(netif, enetIdx, ethernetifConfig);

    return ERR_OK;
}

/**
 * Should be called at the beginning of the program to set up the
 * first network interface. It calls the function low_level_init() to do the
 * actual setup of the hardware.
 *
 * This function should be passed as a parameter to netif_add().
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return ERR_OK if the loopif is initialized
 *         ERR_MEM if private data couldn't be allocated
 *         any other err_t on error
 */
err_t ethernetif0_init(struct netif *netif)
{
    static struct ethernetif ethernetif_0;
    AT_NONCACHEABLE_SECTION_ALIGN(static enet_rx_bd_struct_t rxBuffDescrip_0[ENET_RXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);
    AT_NONCACHEABLE_SECTION_ALIGN(static enet_tx_bd_struct_t txBuffDescrip_0[ENET_TXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);
    SDK_ALIGN(static rx_buffer_t rxDataBuff_0[ENET_RXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);
    SDK_ALIGN(static tx_buffer_t txDataBuff_0[ENET_TXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);

    ethernetif_0.RxBuffDescrip = &(rxBuffDescrip_0[0]);
    ethernetif_0.TxBuffDescrip = &(txBuffDescrip_0[0]);
    ethernetif_0.RxDataBuff = &(rxDataBuff_0[0]);
    ethernetif_0.TxDataBuff = &(txDataBuff_0[0]);

    return ethernetif_init(netif, &ethernetif_0, 0U, (ethernetif_config_t *)netif->state);
}

#if (defined(FSL_FEATURE_SOC_ENET_COUNT) && (FSL_FEATURE_SOC_ENET_COUNT > 1)) \
 || (defined(FSL_FEATURE_SOC_LPC_ENET_COUNT) && (FSL_FEATURE_SOC_LPC_ENET_COUNT > 1))
/**
 * Should be called at the beginning of the program to set up the
 * second network interface. It calls the function low_level_init() to do the
 * actual setup of the hardware.
 *
 * This function should be passed as a parameter to netif_add().
 *
 * @param netif the lwip network interface structure for this ethernetif
 * @return ERR_OK if the loopif is initialized
 *         ERR_MEM if private data couldn't be allocated
 *         any other err_t on error
 */
err_t ethernetif1_init(struct netif *netif)
{
    static struct ethernetif ethernetif_1;
    AT_NONCACHEABLE_SECTION_ALIGN(static enet_rx_bd_struct_t rxBuffDescrip_1[ENET_RXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);
    AT_NONCACHEABLE_SECTION_ALIGN(static enet_tx_bd_struct_t txBuffDescrip_1[ENET_TXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);
    SDK_ALIGN(static rx_buffer_t rxDataBuff_1[ENET_RXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);
    SDK_ALIGN(static tx_buffer_t txDataBuff_1[ENET_TXBD_NUM], FSL_ENET_BUFF_ALIGNMENT);

    ethernetif_1.RxBuffDescrip = &(rxBuffDescrip_1[0]);
    ethernetif_1.TxBuffDescrip = &(txBuffDescrip_1[0]);
    ethernetif_1.RxDataBuff = &(rxDataBuff_1[0]);
    ethernetif_1.TxDataBuff = &(txDataBuff_1[0]);

    return ethernetif_init(netif, &ethernetif_1, 1U, (ethernetif_config_t *)netif->state);
}
#endif /* FSL_FEATURE_SOC_*_ENET_COUNT */

static void tcpip_dhcpc_cb(struct netif *pstnetif) {
    struct dhcp *dhcp = (struct dhcp *)netif_get_client_data(pstnetif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);
    if (dhcp->state == DHCP_STATE_BOUND)
    {
#if LWIP_IPV4 && LWIP_IPV6
        LOG("\r\n IPv4 Address     : %u.%u.%u.%u\r\n", ((u8_t *)&pstnetif->ip_addr.u_addr.ip4)[0],
                ((u8_t *)&pstnetif->ip_addr.u_addr.ip4)[1], ((u8_t *)&pstnetif->ip_addr.u_addr.ip4)[2],
                ((u8_t *)&pstnetif->ip_addr.u_addr.ip4)[3]);
        LOG(" IPv4 Subnet mask : %u.%u.%u.%u\r\n", ((u8_t *)&pstnetif->netmask.u_addr.ip4)[0],
                ((u8_t *)&pstnetif->netmask.u_addr.ip4)[1], ((u8_t *)&pstnetif->netmask.u_addr.ip4)[2],
                ((u8_t *)&pstnetif->netmask.u_addr.ip4)[3]);
        LOG(" IPv4 Gateway     : %u.%u.%u.%u\r\n\r\n", ((u8_t *)&pstnetif->gw.u_addr.ip4)[0],
                ((u8_t *)&pstnetif->gw.u_addr.ip4)[1], ((u8_t *)&pstnetif->gw.u_addr.ip4)[2],
                ((u8_t *)&pstnetif->gw.u_addr.ip4)[3]);
#else
#if LWIP_IPV4
        LOG("\r\n IPv4 Address     : %u.%u.%u.%u\r\n", ((u8_t *)&pstnetif->ip_addr.addr)[0],
               ((u8_t *)&pstnetif->ip_addr.addr)[1], ((u8_t *)&pstnetif->ip_addr.addr)[2],
               ((u8_t *)&pstnetif->ip_addr.addr)[3]);
        LOG(" IPv4 Subnet mask : %u.%u.%u.%u\r\n", ((u8_t *)&pstnetif->netmask.addr)[0],
               ((u8_t *)&pstnetif->netmask.addr)[1], ((u8_t *)&pstnetif->netmask.addr)[2],
               ((u8_t *)&pstnetif->netmask.addr)[3]);
        LOG(" IPv4 Gateway     : %u.%u.%u.%u\r\n\r\n", ((u8_t *)&pstnetif->gw.addr)[0],
               ((u8_t *)&pstnetif->gw.addr)[1], ((u8_t *)&pstnetif->gw.addr)[2],
               ((u8_t *)&pstnetif->gw.addr)[3]);
#endif //LWIP_IPV4
#endif //LWIP_IPV4 && LWIP_IPV6
        aos_post_event(EV_WIFI, CODE_WIFI_ON_GOT_IP, 0xdeaddead);
    }
    return;
}

err_t tcpip_dhcpc_start(struct netif *pstnetif)
{
    if (NULL == pstnetif){
        LOG("%s input netif is NULL \r\n");
        return -1;
    }

    if (netif_is_up(pstnetif)) {
        if (dhcp_start(pstnetif) != ERR_OK) {
            LOG("dhcp client start failed");
            return -1;
        }
    }

    netif_set_status_callback(pstnetif, tcpip_dhcpc_cb);
}


#define configMAC_ADDR {0x02, 0x12, 0x13, 0x10, 0x15, 0x22}

static void tcpip_init_done(void *arg) {
    ethernetif_config_t fsl_enet_config0 = {
        .phyAddress = 0x05, .clockName = kCLOCK_CoreSysClk, .macAddress = configMAC_ADDR,
    };
#if LWIP_IPV4
    ip4_addr_t fsl_netif0_ipaddr, fsl_netif0_netmask, fsl_netif0_gw;
    IP4_ADDR(&fsl_netif0_ipaddr, 0U, 0U, 0U, 0U);
    IP4_ADDR(&fsl_netif0_netmask, 0U, 0U, 0U, 0U);
    IP4_ADDR(&fsl_netif0_gw, 0U, 0U, 0U, 0U);
    netif_add(&fsl_netif0, &fsl_netif0_ipaddr, &fsl_netif0_netmask, &fsl_netif0_gw, &fsl_enet_config0, ethernetif0_init,
              ethernet_input);
#endif

#if LWIP_IPV6
#if !LWIP_IPV4
    netif_add(&fsl_netif0, &fsl_enet_config0, ethernetif_init, tcpip_input);
#endif
    netif_create_ip6_linklocal_address(&fsl_netif0, 1);
    fsl_netif0.ip6_autoconfig_enabled = 1;
#endif
    netif_set_default(&fsl_netif0);
    netif_set_up(&fsl_netif0);
	tcpip_dhcpc_start(&fsl_netif0);
}

int lwip_tcpip_init(void)
{
    tcpip_init(NULL, NULL);
    tcpip_init_done(NULL);
    LOG("TCP/IP initialized.");

    return 0;
}
